yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8af6126.h
#define TIM2_SR2_CC10F           TIM2_SR2_bit.CC10F
#define TIM2_SR2_CC20F           TIM2_SR2_bit.CC20F
#define TIM2_SR2_CC30F           TIM2_SR2_bit.CC30F

#define TIM2_EGR_UG              TIM2_EGR_bit.UG
#define TIM2_EGR_CC1G            TIM2_EGR_bit.CC1G
#define TIM2_EGR_CC2G            TIM2_EGR_bit.CC2G
#define TIM2_EGR_CC3G            TIM2_EGR_bit.CC3G
#define TIM2_EGR_TG              TIM2_EGR_bit.TG

#define TIM2_CCMR1_CC1S0         TIM2_CCMR1_bit.CC1S0
#define TIM2_CCMR1_CC1S1         TIM2_CCMR1_bit.CC1S1
#define TIM2_CCMR1_OC1PE         TIM2_CCMR1_bit.OC1PE
#define TIM2_CCMR1_OC1M0         TIM2_CCMR1_bit.OC1M0
#define TIM2_CCMR1_OC1M1         TIM2_CCMR1_bit.OC1M1
#define TIM2_CCMR1_OC1M2         TIM2_CCMR1_bit.OC1M2

#define TIM2_CCMR2_CC2S0         TIM2_CCMR2_bit.CC2S0
#define TIM2_CCMR2_CC2S1         TIM2_CCMR2_bit.CC2S1
#define TIM2_CCMR2_OC2PE         TIM2_CCMR2_bit.OC2PE
#define TIM2_CCMR2_OC2M0         TIM2_CCMR2_bit.OC2M0
#define TIM2_CCMR2_OC2M1         TIM2_CCMR2_bit.OC2M1
#define TIM2_CCMR2_OC2M2         TIM2_CCMR2_bit.OC2M2

#define TIM2_CCMR3_CC3S0         TIM2_CCMR3_bit.CC3S0
#define TIM2_CCMR3_CC3S1         TIM2_CCMR3_bit.CC3S1
#define TIM2_CCMR3_OC3PE         TIM2_CCMR3_bit.OC3PE
#define TIM2_CCMR3_OC3M0         TIM2_CCMR3_bit.OC3M0
#define TIM2_CCMR3_OC3M1         TIM2_CCMR3_bit.OC3M1
#define TIM2_CCMR3_OC3M2         TIM2_CCMR3_bit.OC3M2

#define TIM2_CCER1_CC1E          TIM2_CCER1_bit.CC1E
#define TIM2_CCER1_CC1P          TIM2_CCER1_bit.CC1P
#define TIM2_CCER1_CC2E          TIM2_CCER1_bit.CC2E
#define TIM2_CCER1_CC2P          TIM2_CCER1_bit.CC2P

#define TIM2_CCER2_CC3E          TIM2_CCER2_bit.CC3E
#define TIM2_CCER2_CC3P          TIM2_CCER2_bit.CC3P

#define TIM2_PSCR_PSC            TIM2_PSCR_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      TIM2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM2_CR1_CEN        0x01
#define MASK_TIM2_CR1_UDIS       0x02
#define MASK_TIM2_CR1_URS        0x04
#define MASK_TIM2_CR1_OPM        0x08
#define MASK_TIM2_CR1_ARPE       0x80

#define MASK_TIM2_IER_UIE        0x01
#define MASK_TIM2_IER_CC1IE      0x02
#define MASK_TIM2_IER_CC2IE      0x04
#define MASK_TIM2_IER_CC3IE      0x08
#define MASK_TIM2_IER_TIE        0x40

#define MASK_TIM2_SR1_UIF        0x01
#define MASK_TIM2_SR1_CC1IF      0x02
#define MASK_TIM2_SR1_CC2IF      0x04
#define MASK_TIM2_SR1_CC3IF      0x08
#define MASK_TIM2_SR1_TIF        0x40

#define MASK_TIM2_SR2_CC10F      0x02
#define MASK_TIM2_SR2_CC20F      0x04
#define MASK_TIM2_SR2_CC30F      0x08

#define MASK_TIM2_EGR_UG         0x01
#define MASK_TIM2_EGR_CC1G       0x02
#define MASK_TIM2_EGR_CC2G       0x04
#define MASK_TIM2_EGR_CC3G       0x08
#define MASK_TIM2_EGR_TG         0x40

#define MASK_TIM2_CCMR1_CC1S0    0x01
#define MASK_TIM2_CCMR1_CC1S1    0x02
#define MASK_TIM2_CCMR1_OC1PE    0x08
#define MASK_TIM2_CCMR1_OC1M0    0x10
#define MASK_TIM2_CCMR1_OC1M1    0x20
#define MASK_TIM2_CCMR1_OC1M2    0x40

#define MASK_TIM2_CCMR2_CC2S0    0x01
#define MASK_TIM2_CCMR2_CC2S1    0x02
#define MASK_TIM2_CCMR2_OC2PE    0x08
#define MASK_TIM2_CCMR2_OC2M0    0x10
#define MASK_TIM2_CCMR2_OC2M1    0x20
#define MASK_TIM2_CCMR2_OC2M2    0x40

#define MASK_TIM2_CCMR3_CC3S0    0x01
#define MASK_TIM2_CCMR3_CC3S1    0x02
#define MASK_TIM2_CCMR3_OC3PE    0x08
#define MASK_TIM2_CCMR3_OC3M0    0x10
#define MASK_TIM2_CCMR3_OC3M1    0x20
#define MASK_TIM2_CCMR3_OC3M2    0x40

#define MASK_TIM2_CCER1_CC1E     0x01
#define MASK_TIM2_CCER1_CC1P     0x02
#define MASK_TIM2_CCER1_CC2E     0x10
#define MASK_TIM2_CCER1_CC2P     0x20

#define MASK_TIM2_CCER2_CC3E     0x01
#define MASK_TIM2_CCER2_CC3P     0x02

#define MASK_TIM2_PSCR_PSC       0x0F


/*-------------------------------------------------------------------------
 *      TIM3 register definitions
 *-----------------------------------------------------------------------*/
/* TIM3 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char             : 3;
  unsigned char ARPE        : 1;
} __BITS_TIM3_CR1;
#endif
__IO_REG8_BIT(TIM3_CR1,    0x5320, __READ_WRITE, __BITS_TIM3_CR1);

/* TIM3 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char CC3IE       : 1;
} __BITS_TIM3_IER;
#endif
__IO_REG8_BIT(TIM3_IER,    0x5321, __READ_WRITE, __BITS_TIM3_IER);

/* TIM3 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char CC3IF       : 1;
} __BITS_TIM3_SR1;
#endif
__IO_REG8_BIT(TIM3_SR1,    0x5322, __READ_WRITE, __BITS_TIM3_SR1);

/* TIM3 status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC10F       : 1;
  unsigned char CC20F       : 1;
} __BITS_TIM3_SR2;
#endif
__IO_REG8_BIT(TIM3_SR2,    0x5323, __READ_WRITE, __BITS_TIM3_SR2);

/* TIM3 event generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
} __BITS_TIM3_EGR;
#endif
__IO_REG8_BIT(TIM3_EGR,    0x5324, __READ_WRITE, __BITS_TIM3_EGR);

/* TIM3 capture/compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S0       : 1;
  unsigned char CC1S1       : 1;
  unsigned char             : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M0       : 1;
  unsigned char OC1M1       : 1;
  unsigned char OC1M2       : 1;
} __BITS_TIM3_CCMR1;
#endif
__IO_REG8_BIT(TIM3_CCMR1,  0x5325, __READ_WRITE, __BITS_TIM3_CCMR1);

/* TIM3 capture/compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S0       : 1;
  unsigned char CC2S1       : 1;
  unsigned char             : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M0       : 1;
  unsigned char OC2M1       : 1;
  unsigned char OC2M2       : 1;
} __BITS_TIM3_CCMR2;
#endif
__IO_REG8_BIT(TIM3_CCMR2,  0x5326, __READ_WRITE, __BITS_TIM3_CCMR2);

/* TIM3 capture/compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM3_CCER1;
#endif
__IO_REG8_BIT(TIM3_CCER1,  0x5327, __READ_WRITE, __BITS_TIM3_CCER1);

/* TIM3 counter high */
__IO_REG8    (TIM3_CNTRH,  0x5328, __READ_WRITE);
/* TIM3 counter low */
__IO_REG8    (TIM3_CNTRL,  0x5329, __READ_WRITE);
/* TIM3 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 4;
} __BITS_TIM3_PSCR;
#endif
__IO_REG8_BIT(TIM3_PSCR,   0x532A, __READ_WRITE, __BITS_TIM3_PSCR);

/* TIM3 auto-reload register high */
__IO_REG8    (TIM3_ARRH,   0x532B, __READ_WRITE);
/* TIM3 auto-reload register low */
__IO_REG8    (TIM3_ARRL,   0x532C, __READ_WRITE);
/* TIM3 capture/compare register 1 high */
__IO_REG8    (TIM3_CCR1H,  0x532D, __READ_WRITE);
/* TIM3 capture/compare register 1 low */
__IO_REG8    (TIM3_CCR1L,  0x532E, __READ_WRITE);
/* TIM3 capture/compare register 2 high */
__IO_REG8    (TIM3_CCR2H,  0x532F, __READ_WRITE);
/* TIM3 capture/compare register 2 low */
__IO_REG8    (TIM3_CCR2L,  0x5330, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM3 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

